import java.util.ArrayList;
import java.util.List;

import static Lists.Practice.*;

public class Main {
    public static void main(String[] args) {
        List<String> list = new ArrayList<>();

        Task16(list);

        /*
        Task1: Создание списка и добавление элементов (add())
        Task2: Итерация по списку (for-each, listIterator(), for-i)
        Task3: Удаление элементов (remove())
        Task4: Изменение элемента по индексу (set())
        Task5: Поиск индекса элемента (indexOf())
        Task6: Проверка на наличие элемента (contains())
        Task7: Получение размера списка (size())
        Task8: Очистка списка (clear())
        Task9: Проверка на пустоту (isEmpty())
        Task10: Сортировка списка (sort())
        Task11: Создание подсписка (subList())
        Task12: Добавление всех элементов из одного списка в другой (addAll())
        Task13: Проверка наличия вхождения элементов одного списка в другой (containsAll())
        Task14: Преобразование списка в массив (toArray())
        Task15: Создание изменяемого подсписка и его модификация
        Task16: Добавление всех элементов из массива в список
        Task17: Проверка на наличие всех элементов из списка в массиве
        Task18: Создание неизменяемого подсписка
        Task19: Преобразование списка в массив с использованием метода ссылки
        Task20: Удаление всех элементов из одного списка, которые содержатся в другом
         */
    }
}